In [1]:
import pandas as pd

In [2]:
df = pd.read_csv ('attacks_completo .csv')

1. Â¿CuÃ¡ntos ataques hubo por paÃ­s? Devuelve un DataFrame.
ðŸ“Œ NOTA Ordena los resultados de mayor a menor. Esto todavÃ­a no lo hemos visto, pero un DataFrame lo podemos ordenar con .sort_values(). AquÃ­ tenÃ©is una explicaciÃ³n de cÃ³mo hacerlo.

In [3]:
df_paises = df.groupby (['country'])['case_number'].count()
df_paises.head(10)

country
 PHILIPPINES                  1
 TONGA                        3
ADMIRALTY ISLANDS             1
AFRICA                        1
ALGERIA                       1
AMERICAN SAMOA                3
ANDAMAN / NICOBAR ISLANDAS    1
ANDAMAN ISLANDS               1
ANGOLA                        1
ANTIGUA                       2
Name: case_number, dtype: int64

In [4]:
df_paises.sort_values(ascending=False, inplace=True)

In [5]:
df_paises= pd.DataFrame(df_paises).reset_index()

2. Â¿CuÃ¡ntos ataques ha habido por aÃ±o? Devuelve un DataFrame. De nuevo ordena los resultados de mayor a menor.

In [6]:
df_year= df.groupby(['year'])['case_number'].count()
df_year.sort_values(ascending=False, inplace=True)

In [7]:
df_year= pd.DataFrame(df_year).reset_index()

3. Â¿CuÃ¡ntos ataques hubo por aÃ±o y sexo? Devolved un DataFrame solo del aÃ±o 2000 en adelante.

In [8]:
df_sexo_year= df.groupby (['sex_','year'])['case_number'].count()
df_sexo_year.sort_values (ascending=True, inplace=True)
df_sexo_year=pd.DataFrame(df_sexo_year).reset_index()
df_sexo_year

    sex_    year  case_number
0      .  1908.0            1
1      M  1767.0            1
2      M  1764.0            1
3      M  1758.0            1
4      M  1755.0            1
..   ...     ...          ...
347    M  2008.0          103
348    M     0.0          104
349    M  2016.0          105
350    M  2011.0          109
351    M  2015.0          114

[352 rows x 3 columns]

In [9]:
df_sexo_year2000= df_sexo_year[df_sexo_year['year']>2000]
df_sexo_year2000.head(2)

   sex_    year  case_number
28   M   2014.0            1
29   M   2005.0            1

4. Primero extraed solo las filas que correspondan a USA, AUSTRALIA y SOUTH AFRICA. Â¿CuÃ¡ntos de los ataques fueron letales por sexo? Devuelve un DataFrame.

In [11]:
df_usa= df[df['country'].isin (['USA', 'AUSTRALIA', 'SOUTH AFRICA'])]
df_usa.head(1)

,Unnamed: 0,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,fatal_(y/n),injury,date
0,0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018

In [12]:
df_usa.columns

Index(['Unnamed: 0', 'case_number', 'year', 'type', 'country', 'area',
       'location', 'activity', 'name', 'sex_', 'age', 'time', 'species_',
       'fatal_(y/n)', 'injury', 'date'],
      dtype='object')

In [13]:
df_usa2= df_usa.groupby (['sex_','country', 'fatal_(y/n)']) ['case_number'].count()
df_usa_letal= pd.DataFrame(df_usa2)

In [14]:
df2= df_usa_letal.reset_index()
df2.head(5)

  sex_       country fatal_(y/n)  case_number
0    F     AUSTRALIA           N            1
1    F     AUSTRALIA           N           62
2    F     AUSTRALIA           Y           17
3    F  SOUTH AFRICA           N           15
4    F  SOUTH AFRICA     UNKNOWN            1

In [15]:

filtro= df2[df2['fatal_(y/n)']=='Y']
filtro

   sex_       country fatal_(y/n)  case_number
2     F     AUSTRALIA           Y           17
5     F  SOUTH AFRICA           Y            5
8     F           USA           Y           13
12    M     AUSTRALIA           Y          264
15    M  SOUTH AFRICA           Y          100
18    M           USA           Y          169

5. Usando el DataFrame creado en el ejercicio anterior. Â¿En quÃ© paÃ­s hubo mÃ¡s ataques?

In [22]:
df4 = df2.groupby('country')['case_number'].sum()
df4.reset_index()

        country  case_number
0     AUSTRALIA         1094
1  SOUTH AFRICA          459
2           USA         1953

6. Â¿QuÃ© y cuÃ¡ntos tipos de ataques hubo por paÃ­s?

In [ ]:
df_tipos=df.groupby ('country')['type'].value_counts()

cuadro_tipos= pd.DataFrame (df_tipos)
cuadro_tipos.reset_index()